let word = document.querySelector('.word')
let robotorhuman = confirm('гра з роботом?')
let words = []
let strword =
	'Авдіївка Якимівка Олександрія Олександрівка Олександрівка Алупка Алушта Алчевськ Амвросіївка Антрацит Апостолове Арбузинка Армянськ Артемівськ Арциз Охтирка Балаклія Балта бар Баранівка Барвінкове Баришівка Бахмач Бахчисарай Баштанка Біла Церква Білгород-Дністровський Біловодськ Білогірськ Білогір`я Білозерка Білопілля Біляївка Бердичів Бердянськ Берегово Бережани Березанка Березино Березівка Берислав Бершадь Близнюки Бобринець Бобровиця Богодухів Богуслав Болград Болехів Борзна Борислав Бориспіль Борова Бородянка Борщів Боярка Бровари Броди Брусилів Брянка Бузуків Бурштин Буринь Буськ Буча Валки Варва Василівка Васильків Васильківка Велика Білозерка Велика Новосілка Верхньодніпровськ верхів Верховина Веселинове Веселе Вижниця Вінниця Виноградов Віньківці Вишневе Володимир-Волинський Володимирець Вознесенськ Волноваха Воловець Володарка Володарське Волочиськ Вовчанськ Вільногірськ Вільнянськ Врадіївка Високопілля Вишгород Гадяч Гайворон Гайсин Галич Гаспра Генічеськ Герца Глеваха Глобине Глухів Глибока Гола Пристань Голованівськ Горлівка Горностаївка Городенка Городище Городня Городок Горохів Гоща Гребінка Гуляйполе Гурзуф Гусятин Дворічна Дебальцеве Демидівка Деражня Дергачі Джанкой Дзержинськ Диканька Дніпродзержинськ Дніпропетровськ Дніпрорудне Добропілля Добрянка Докучаєвськ Долина Долинська Доманівка Донецьк Драбів Дрогобич Дружківка Дубно Дубровиця Дунаївці Євпаторія Єланець Ємільчине Єнакієве Жашків Жовті Води Жидачів Житомир Жмеринка Жовква'
let robot = strword.split(' ')
console.log(robot)
console.log(robotorhuman)
if (robotorhuman === true) {
	word.addEventListener('keypress', function (e) {
		if (e.key == 'Enter') {
			console.log(words)
			for (let i = 0; i <= words.length; i++) {
				for (let j = 0; j < robot.length; j++) {
					const element = array[j];
					
				}
				if (words[i] != words[i - 1] && words[i][-1] == words[i - 1][-1]) {
					words.push(word.value)
				}
			}
		}
	})
}
